const text = {
	bg: {
		title: 'Генератор за отбори',
		peopleField: {
			label1: 'Въведете имената на хората, всяко на нов ред:',
			subLabel1: 'Брой хора: ',
		},
		teamsField: {
			label1: 'Колко отбора искате да сформирате?',
		},
		teamNamesField: {
			label1:
				'Ако искате отборите да имат имена, напишете ги тук, всяко на нов ред:',
		},
		btnTxt: 'Генерирай отборите',
		alert: {
			success: {
				mainTxt: 'Отборите са сформирани',
				secTxt: 'Кликнете, за да ги видите',
			},
			fail: {
				mainTxt: 'Нещо се обърка!',
				secTxt: 'Моля, проверете въведените данни',
			},
		},

		infoBox: {
			title: 'За приложението',
			articles: [
				{
					title: 'Предназначение',
					html: (
						<p>
							Това, което приложението прави, е да разделя в отбори хора, чиито
							имена са предоставени от потребителя, на напълно случаен принцип.
							Отборите могат да бъдат използвани за разпределение на играчи в
							някоя игра или по преценка на потребителя.
						</p>
					),
				},
				{
					title: 'Как работи приложението?',
					html: (
						<>
							<p>
								За да получите желаните отбори, трябва да въведете имената на
								хората, разделени със запетаи Разделят се имената на един човек
								и имената на друг, а не – името, презимето и фамилията на един
								човек. Например – Иван Петров Георгиев, Георги, Мартин Антонов.
								и колко отбора желаете да бъдат сформирани. След като сте
								попълнили нужната информация и цъкнете бутона, ще получите
								известие в долния десен ъгъл. Ако всичко е наред, натискайки
								върху известието, ще се отвори т.нар. Team Board, където са
								Вашите отбори. В противен случай, ще бъдете известен/а, че има
								проблем. Тогава трябва да проверите предоставената от Вас
								информация
							</p>
							<p>Възможни причини за случване на грешка са:</p>
							<ul className='list'>
								<li>
									оставили сте някое от полетата празни, т.е без информация;
								</li>
								<li>
									искате да сформирате повече отбори, отколкото са хората,
									например – 2 човека и 3 отбора;
								</li>
								<li>
									написали сте нещо, различно от цяло число, в полето, в което
									трябва да кажете колко отбора желаете.
								</li>
							</ul>
							<p></p>
						</>
					),
				},
				{
					title: 'Меню',
					html: (
						<>
							<p>В менюто ще откриете няколко опции:</p>
							<ol className='list'>
								<li>
									информация за приложението – отваря информацията за
									приложението – информацията, която четете в момента;
								</li>
								<li>иконка, която отваря Team Board-а при кликане;</li>
								<li>
									насторойки, в които можете да управлявате начина на разделяне
									на хора по отбори и как ще бъдат показани в Team Board-a.
								</li>
							</ol>
							<p></p>
						</>
					),
				},
				{
					title: 'За приложението',
					html: (
						<>
							<p>
								Приложението е създадено с HTML и е украсено със CSS. Логиката
								на програмата, както и динамиката, са написани на JavaScript.
								Приложението се адаптира към различните размери на екраните. Не
								са използвани допълнителни рамки, библиотеки и т.н.
							</p>
						</>
					),
				},
			],
		},

		teamBoard: {
			title: 'Отбори',
			sort: {
				memberLabel: 'Подреди членовете по:',
				options: [
					{ text: 'азбучен/цифрен ред (възходящо)', value: 'alphabetic+' },
					{ text: 'азбучен/цифрен ред (низходящо)', value: 'alphabetic-' },
					{ text: 'дължина на името (възходящо)', value: 'length+' },
					{ text: 'дължина на името (низходящо)', value: 'length-' },
				],
				defaultTeams: 'Подреди отборите по: ',
				defaultMembers: 'Подреди членовете по: ',
			},

			noTeams: 'Няма сформирани отбори.',
			excluded: 'Членове, които не участват в нито един отбор: ',
		},

		settings: {
			title: 'Настройки',
			label: 'Ако отборите не могат да бъдат с равен брой членове: ',
			options: [
				{
					text: 'да бъдат с неравен брой членове',
					value: 'inequal',
				},
				{
					text: 'нужният брой души да не бъде добавян към отборите',
					value: 'excluding',
				},
			],

			closeBtnTxt: 'Затвори',
		},
	},
};

export default text;
